

/*
	cb用户输入到达时间， 运行时间， 优先级l
	进程记录 到达时间，中断时的时间与断点
	CPU记录pc、控制进程阻塞与运行
	引用 时间概念 来实现 模拟多进程运行

	设定：每两秒完成一道小步骤（PV操作不算） ，故而实际运行时间固定为 8s

	注意：进入队列的进程均为复制品，不能为本体，所以需要实时更新实体信息
*/



#include"DEFINITION.h"


int main() {
	printf("*生产者消费者模拟\n");
	printf("————————————————————————————————————\n");

/*----------------------------------------------------------*/
	///*文件管理模块*/
	//printf("*请输入字符串:\n");
	//scanf("%s", str);    // string数组存放将要产生的字符
	//getchar();
	//len = strlen(str);
	//count = len;		 // 输入字符的个数
	
	printf("正在从磁盘文件中读取预生产的字符...\n");
	
	fileManage();								 // 选择文件调度算法
	
	printf("\n————————————————————————————————————\n");
	printf("按下任意键继续...\n");
	getchar();
/*----------------------------------------------------------*/
	len = strlen(str);
	count = len;		 // 输入字符的个数
	
	// 初始化
	Init();        

	while (con_cnt < len) //消费完所有的字符为结束
	{
		system("cls");  //清屏操作	
		printf("—————————模拟指令流程————————\n");
		Control();      //处理器调度程序
		PrintStatus();        //输出显示各个信息
	}

	Close();
	printf("\n程序结束!\n");
}